zbauman3/illumindex/firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_ENDPOINT_STATE_URL="https://illumindex.vercel.app/api/state"
CONFIG_ENDPOINT_URL="https://illumindex.vercel.app/api/command"
CONFIG_ENDPOINT_FETCH_INTERVAL_DEFAULT=300
CONFIG_TIMEZONE_STRING_DEFAULT="CST6CDT,M3.2.0,M11.1.0"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_ISR_IRAM_SAFE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_PTHREAD_DEFAULT_CORE_0=y
